# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

import room_1 as f1
import room_2 as f2
print('В комнате 1 живут', f1)
print('В комнате 2 живут', f2)